{"_id":{"$oid":"59098dd0c6454c6caf5e1755"},"updatedAt":{"$date":"2017-05-03T08:26:07.795Z"},"createdAt":{"$date":"2017-05-03T07:59:12.191Z"},"title":"Exercice 1","content":"identification: \nbmendy\nbene.mendy@gmail.com\nevaluation\n\n1. Un fork est une version locale du projet comme le pic d'une fourchette. Cette version locale est indépendante et nécessite une pull request pour être intégrée à nouveau au projet. Le collaborateur est quelqu'un d'externe à l'équipe de développement. \n\n2. Forker un projet sert à obtenir une version locale pour pouvoir y apporter des modifications et améliorations. On peut aussi se servir d'un fork pour commencer sa propre idée en étant détaché du projet initial. C'est l’intérêt de travailler en Open Source.\n\n3. On demande l'avis des autres participants du projet avant de merger sa version à la branche commune du projet\n\n4. Une branche est une diversion du projet initial pour pouvoir travailler sur une fonctionnalité en particulier. \n\n5. Un fork est une version locale indépendante au projet et nécessite une pull request pour être intégrée à nouveau au projet. Le collaborateur est quelqu'un d'externe. \nUne branche quand à elle  est une partie intégrante du projet. Elle permet à un collaborateur de l'équipe de développement de travailler sur une fonctionnalité en particulier","__v":0}
{"_id":{"$oid":"5909c6497413c86f2aa12430"},"updatedAt":{"$date":"2017-05-03T12:15:07.039Z"},"createdAt":{"$date":"2017-05-03T12:00:09.144Z"},"title":"Hello exercice5","content":"Je vais arriver à afficher la date","__v":0,"date":{"$date":"2017-05-04T22:00:00.000Z"}}
{"_id":{"$oid":"5909d98d702f793490f2b51d"},"updatedAt":{"$date":"2017-05-03T13:49:15.741Z"},"createdAt":{"$date":"2017-05-03T13:22:21.850Z"},"title":"La MEAN stack","date":null,"content":"Angular : rentre une page dynamique grace à un framework javascript – Front\nAngular UI Router : faire des routes pour faciliter l'affichage des pages avec les différentes url - Back\nExpress : API - Back\nJSONWebToken : authenfication. Contient des infos sur l'utilisateur tels que s'il est admin ou non - Back\nMongoose : fait le lien entre la base de donnée et le front - Back \nMaterializeCSS : framework pour le style – Front // facultatif\nPassport : sert à l'identification – Back // facultatif\nBabel : transforme la syntaxe pour pouvoir être compatible - Back\nSCSS : version plus récente de CSS – front // facultatif\nNodemon : prend en compte le changement dans node.js et redemarre authomatiquement le server - back\nWebpack : faire en sorte que le code s'adapte à des navigateurs plus ancien et à minifier ce code - back\nLivereload : les changements sur ce code et la minification sont fait en direct à la manière de live-server - back\n\nMEAN : MangoDB , Express, Angular et Node permet de développer une application de A à Z et couvrir les aspects front comme back","__v":0}
{"_id":{"$oid":"5909e2d41b63e55dea90fa18"},"updatedAt":{"$date":"2017-05-03T14:01:56.135Z"},"createdAt":{"$date":"2017-05-03T14:01:56.135Z"},"title":"Culture SCRUM","date":{"$date":"2017-05-02T22:00:00.000Z"},"content":"Que sont les méthodes agiles ? \nMéthodes agiles permettent de faire de la gestion de projet pour s'adapter aux changements. A l'inverse des méthodes utilisant des Diagrammes de Gant qui ont des structures plus rigides.\n\nQu’est-ce que SCRUM ? \nSCRUM est une méthodologie avec un scrum master et un product owner. Le projet se réalise sous forme de sprints. \n\nDéfinir le Product BackLog, de quoi est-il constitué ? \nLe product backlog découpe le produit en users stories qui elles memes sont constituées de taches. Chaque tache doit etre attitrées à quelque un de l'équipe de développement avec une estimation de temps. \n\nDéfinir le Product Owner\nLe product owner est l'intermédiare entre l'équipe de dev et le client. Il veille à ce que le projet correspondent à chaque étape aux attentes du client.\n\nDéfinir le SCRUM Master\nLe scrum master est de la coordination des meeting de daily scrum.\n\nDéfinir la « Development team »\nl'équipe de développement est chargée du code du projet.\n\nDéfinir le Sprint, de quoi est-il constitué ?\nLe sprint est constitué des différentes taches qui doivent être réalisées par chaque membre de l 'équipe pour atteindre les objectifs d'un cycle de travail. \nC'est une période définie en début de projet qui correspond en général, à une semaine ou deux.\n\nDéfinir le daily scrum\nMeeting quotidien permettant à chacun de définir ses objectifs. C'est un moyen d'équilibrer les ressources. \n\nQu’est-ce que la planification d’un sprint ? C'est une réunion entre le scrum master, le product owner et l'équipe de développement qui s'effectue en début de cycle pour définir les objectifs du sprint, la répartition des taches et l'estimation de chacune d'elles. Les taches proviennent du product backlog découpé en userstories.\n\nQu’est-ce que la révision d’un sprint ?reunion s'effectuant avec le client et au cours de laquelle ils'agit de présenter les avancées du sprint achevé. \n\nQu’est-ce que la rétrospective d’un sprint ? \nRétrospective : à la fin d'un sprint permet d'identifier les points positifs et les points d'amélioration afin d'appliquer un plan d'action pour les prochains sprints. \nGénéralement animé par un scrum master\n\nPourquoi est-il important de définir la notion de « Done » pour les tâches ?\nil faut définir des critères qui détermine le succès d'une tache\n\nLa notion de « Done » peut-elle évoluer au cours d’un projet SCRUM ?\nOui tout peut évoluer au cours d'un projet Scrum\n\nSCRUM est-elle une méthodologie itérative ? Justifier.\noui on peut considérer la méthode scrum comme un enfant des méthodes itératives  car les sprints peuvent représenter des cycles différents.","__v":0}
{"_id":{"$oid":"5909ea661b63e55dea90fa19"},"updatedAt":{"$date":"2017-05-03T14:58:05.352Z"},"createdAt":{"$date":"2017-05-03T14:34:14.715Z"},"title":"Exercice8","date":null,"content":"Backlog product : \n           - création de la partie admin,  Prio1, elle est userfriendly responsive, stylisée\n           - création du statut admin dans Json web token, Prio1, deux statuts sont différents user et admin\n           - admin peut modifier les articles, supprimer, changer date de publication , Prio2, un utilisateur peut modifier des articles \n          - utilisateur peut seulement editer les articles, Prio2, les utilisateurs ne peuvent pas accéder à la partie pour créer et supprimer des articles\n          - admin peut ajouter des admin, Prio3, les utilisateurs n'ont pas accès à la partie pour créer un admin\n\nSprint : \nCoder la partie admin ( 1/2 journée)\nCréation de l'ajout de la date (30 min)\nCréation de la fonctionnalité publié ( 30 min) \nFonctionnalité création d'un admin (1/2 journée)\nBloquer l’accès à la suppression et la création des articles et la création d'admin à simple utilisateurs (protection des routes) (1h)","__v":0}
